mermaid docs
